Repository: STQT/acham
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Confirmation code for registration on the Acham.uz website: {code}
ru: Код подтверждения для регистрации на сайте Аcham.uz: {code}
uz: Acham.uz saytida roʻyxatdan oʻtish uchun tasdiqlash kodi: {code}

source: OTP code not found or expired.
ru: Код подтверждения не найден или истек.
uz: Tasdiqlash kodi topilmadi yoki muddati o'tdi.

source: OTP code expired.
ru: Код подтверждения истек.
uz: Tasdiqlash kodi muddati o'tdi.

source: Invalid OTP code.
ru: Неверный код подтверждения.
uz: Noto'g'ri tasdiqlash kodi.

source: OTP sent to phone number.
ru: Код подтверждения отправлен на номер телефона.
uz: Tasdiqlash kodi telefon raqamiga yuborildi.

source: Password updated successfully.
ru: Пароль успешно обновлен.
uz: Parol muvaffaqiyatli yangilandi.

source: redirect_uri is required.
ru: Требуется redirect_uri.
uz: redirect_uri talab qilinadi.

source: OAuth client_id is not configured.
ru: OAuth client_id не настроен.
uz: OAuth client_id sozlanmagan.

source: code, state, and redirect_uri are required.
ru: Требуются code, state и redirect_uri.
uz: code, state va redirect_uri talab qilinadi.

source: Invalid or expired state parameter.
ru: Неверный или истекший параметр state.
uz: Noto'g'ri yoki muddati o'tgan state parametri.

source: redirect_uri mismatch.
ru: Несоответствие redirect_uri.
uz: redirect_uri mos kelmaydi.

source: OAuth credentials are not configured.
ru: OAuth учетные данные не настроены.
uz: OAuth hisob ma'lumotlari sozlanmagan.

source: Unable to determine user identifier from provider response.
ru: Не удалось определить идентификатор пользователя из ответа провайдера.
uz: Provayder javobidan foydalanuvchi identifikatorini aniqlash mumkin emas.

source: Authentication required to place an order.
ru: Требуется аутентификация для размещения заказа.
uz: Buyurtma berish uchun autentifikatsiya talab qilinadi.

source: Cart is empty.
ru: Корзина пуста.
uz: Savatcha bo'sh.

source: Order created
ru: Заказ создан
uz: Buyurtma yaratildi

source: Product not found
ru: Товар не найден
uz: Mahsulot topilmadi

source: Product is not available
ru: Товар недоступен
uz: Mahsulot mavjud emas

source: Quantity must be greater than zero
ru: Количество должно быть больше нуля
uz: Miqdor noldan katta bo'lishi kerak

source: Product removed from cart
ru: Товар удален из корзины
uz: Mahsulot savatchadan olib tashlandi

source: Cart not found
ru: Корзина не найдена
uz: Savatcha topilmadi

source: Product not in cart
ru: Товар не в корзине
uz: Mahsulot savatchada yo'q

source: Valid quantity is required
ru: Требуется валидное количество
uz: To'g'ri miqdor talab qilinadi

source: Cart cleared
ru: Корзина очищена
uz: Savatcha tozalandi
